Repository: bertholdm/TextDiff
Catalog: translations/*.po
Languages: de

source: A Calibre GUI plugin to find text differences in two book formats.
de: Ein UI Plugin zum Finden von Unterschieden zwischen zwei Texten.

source: Config
de: Konfiguration

source: These settings controls the basic features of the plugin. Not used yet!
de: Diese Einstellungen legen die grundlegenden Eigenschaften des Plugins fest. Z. Z. nicht verwendet!

source: 1st file (left):
de: Erstes Format (links)

source: 2nd file (right):
de: Zweites Format (rechts)

source: Refresh book formats list
de: Formatliste aktualisieren

source: Display format:
de: Ausgabeformat:

source: See https://docs.python.org/3/library/difflib.html
de: Siehe https://docs.python.org/3/library/difflib.html

source: Font family for output:
de: Schriftfamilie für die Ausgabe:

source: Monospace, when not HTML output.
de: Feste Zeichenbreite, wenn nicht HTML-Ausgabe.

source: Context handling by plugin
de: Kontext-Handling durch Plugin

source: Check, if context handling is is to be performed by plugin, not by Difflib.
de: Anhaken, wenn die Kontext-Verarbeitung durch das Plugin durchgeführt werden soll, nicht durch Difflib.

source: Suppress identical lines, preserve n context line(s)
de: Unterdrücke identische Zeilen, bis auf Kontext

source: Set context to True when contextual differences are to be shown, else the default is False to show the full files.
de: Anhaken, wenn Unterschiede im Kontext angezeigt werden sollen, ansonsten wird der komplette Text angezeigt.

source: Number of context lines:
de: Anzahl Kontext-Zeilen:

source: When context is True numlines controls the number of context lines which surround the difference highlights. When context is False numlines controls the number of lines which are shown before a difference highlight when using the “next” hyperlinks (setting to zero would cause the “next” hyperlinks to place the next difference highlight at the top of the browser without any leading context).
de: Wenn das Kontrollkästen "Kontext" angehakt ist, steuert "Anzahl Zeilen" die Anzahl der Kontextzeilen, die die markierten Differenzen umgeben. Wenn nicht, gibt "Anzahl Zeilen" die Anzahl Zeilen an, die vor markierten Unterschieden angezeigt werden, wenn die „Nächster“-Hyperlinks verwendet werden.

source: Debug print
de: Testausgabe

source: Check to toggle debug print on.
de: Anhaken, um die Testausgabe zu aktivieren.

source: Substitute chars
de: Ersetze Zeichen

source: Check to Substitute chars (fixed table for now).
de: Prüfe auf zu ersetzende Zeichen (momentan vorgegebene Tabelle).

source: Tabsize (HtmlDiff):
de: Tabulatorweite (nur bei HtmlDiff):

source: Specify tab stop spacing when converting tabs to spaces and viceversa.
de: Lege die Tabweite fest für die Umwandlung von Tabs in Leerzeichen, und umgekehrt.

source: Wrap columns at (HtmlDiff):
de: Umbruch bei Spalte (bei HtmlDiff):

source: Specify column number where lines are broken and wrapped. 0 for not to break.
de: Die Spalte angeben, ab der Zeilen umgebrochen werden sollen. Null (0) für keinen Umbruch.

source: Compare
de: Vergleiche

source: Ratio is:
de: Das Übereinstimmungsverhältnis ist:

source: A measure of the sequences’ similarity as a float in the range [0, 1].
de: Ein Maß für die Ähnlichkeit der beiden Texte (als Fließkommazahl zwischen 0 und 1).

source: Copy output to clipboard.
de: Ergebnis in die Zwischenablage kopieren.

source: Save output to file
de: Ergebnis als Datei speichern

source: Save output as book
de: Ergebnis als Buch ablegen

source: TextDiff error
de: TextDiff Fehler

source: One or two books (with at least total two formats) must be marked.
de: Ein oder zwei Bücher mit zusammen mindestens zwei Dateiformaten müssen markiert sein.

source: Book {0} has no formats!
de: Buch {0} hat keine Formate!

source: Book has no formats!
de: Buch hat keine Formate!

source: Starting compare...
de: Beginne Vergleich...

source: No books selected
de: Kein Buch ausgewählt

source: You must select one book with more than one format or two books to perform this action.
de: Sie müssen entweder ein Buch mit mindestens zwei Formaten oder genau zwei Bücher mit zusammen mindestens zwei Formaten auswählen.

source: Too much books selected
de: Zu viele Bücher ausgewählt (max. 2)

source: You must select one book with more than one format or two books with at least two formats in sum to perform this action.
de: Sie müssen entweder ein Buch mit mindestens zwei Formaten oder genau zwei Bücher mit zusammen mindestens zwei Formaten auswählen.

source: Not enough formats to compare
de: Mindestens zwei Dateien für den Vergleich notwendig

source: The selected book(s) must have at least two formats in sum to compare.
de: Das gewählte Buch oder die gewählten Bücher müssen zusammen mindestens zwei Dateiformate haben.

source: Could not open pdf format of book no. {0} ({1}). Probably password protected. Abort.
de: Konnte das PDF-Format von Buch Nr. {0} ({1}) nicht öffnen. Wahrscheinlich Kennwort-geschützt. Abbruch.

source: PDF format of book no. {0} ({1}) contains no text (pdf from image). Abort.
de: PDF Format von Buch Nr. {0} ({1}) enthält keinen Text (gescanntes PDF). Abbruch.

source: Other error in pdf format of book no. {0} ({1}). Abort.
de: Sonstiger Fehler beim Öffnen des PDF-Formats für Buch Nr. {0} ({1}). Abbruch.

source: Error in pdf format
de: Fehler beim Öffnen des PDF-Formats

source: Starting convert...
de: Beginne Konvertierung zu Text...

source: Convert finished.
de: Konvertierung beendet.

source: No compare possible, since at least one convert failed.
de: Kein Vergleich möglich, da mindestens ein Konvertierungsvorgang fehlgeschlagen ist.

source: Format conversion finished. Beginning compare...
de: Formatumwandlung beendet. Beginne Vergleich...

source: Format conversion finished.
de: Formatumwandlung beendet.

source: Building replacement dict...
de: Erstelle die Ersetzungstabelle...

source: Building replacement dict finished. Beginning replacing...
de: Erstellung der Ersetzungstabelle beendet. Beginne Ersetzung...

source: Replacing finished. Beginning compare...
de: Zeichenersetzung beendet. Beginne Vergleich...

source: No differences found in text. However, there may be differences in metadata, formatting or MIME content.
de: Keine Unterschiede im Text gefunden. Es ist aber möglich, dass sich die beiden Dateien in den Metadaten, der Formatierung oder Multimedia-Inhalten unterscheiden.

source: Putting result in text browser window...
de: Schaufele das Ergebnis in das Text-Browser-Fenster...

source: No diff result! Please report this.
de: Kein Vergleichsergebnis! Bitte als Fehler melden.

source: Unknown difftype or result:\n
de: Unbekannte Vergleichsoption oder nicht erwartetes Ergebnis:\n

source: Compare finished.
de: Vergleich beendet.

source: Enter ebook_convert()...
de: Beginne ebook_convert()...

source: Starting ebook_convert()...
de: Starte ebook_convert()...

source: Starting ebook-convert...
de: Beginne Konvertierung zu Text...

source: The file "{0}" don't exist. Probably conversion to text format failed.
de: Textformat für die Datei {0} wurde nicht gefunden. Wahrscheinlich ist die Umwandlung fehlgeschlagen.

source: Compare aborted.
de: Vergleich abgebrochen.

source: Deleting temp file...
de: Lösche temporäre Datei...

source: Finishing ebook_convert().
de: Beende ebook_convert().

source: No differences found!
de: Keine Unterschiede im Text gefunden!

source: Instantiate HtmlDiff...
de: Instanziiere HtmlDiff...

source: Calling HtmlDiff.make_table()...
de: Starte HtmlDiff.make_table()...

source: Diff finished. Building final HTML output...
de: Diff beendet. Erstelle die endgültige HTML-Ausgabe.

source: Stripping identical lines...
de: Unterdrücke übereinstimmende Zeilen...

source: [{0} identical line(s).]
de: [{0} identische Zeile(n).]

source: Condensing diff result finished.
de: Komprimierung des Diff-Ergebnisses beendet.

source: Unknown compare option!
de: Nicht erwartete Vergleichsoption!

source: Enter save_diff_file()...
de: Beginne save_diff_file()...

source: HTML file (*.html)
de: HTML-Datei (*.html)

source: Save File
de: Datei speichern

source: Save to file
de: Ergebnis als Datei speichern

source: No path/file given.
de: Kein Ausgabepfad angegeben.

source: Adding book...
de: Füge ein Buch hinzu...

source: Create book...
de: Erstelle Buch...

source: Setting cover...
de: Erstelle ein Titelbild...

source: Adding format...
de: Füge ein Format hinzu...

source: Book saved.
de: Buch gespeichert.

source: Save diff to book.
de: Speichere Vergleichsergebnis als Buch.

source: Book with diff content as format added
de: Buch mit dem Ergebnis des Vergleichs als Format hinzugefügt

source: Run the TextDiff Plugin.
de: TextDiff-Plugin starten.

source: Compare...
de: Vergleiche...

source: Settings...
de: Einstellungen...

source: About...
de: Über...

source: Help...
de: Hilfe...
